[
  {
    "id": 1,
    "date": "June 2014",
    "title1": "Graduated from",
    "title2": "High school",
    "subtitle": "Not accepted any of the top Universities GPA: 3.75",
    "description": "Participated in music program and engineering program. Was introduces to electronics through Vex Robotic competitions. I sold candy in the school the first couple of years and when I turned 16 picked up a jobs at Togos and Baskin Robbins. Also attended the local community college using concurrent enrollment while in high school and I learn more about coding,  design, and different things but I did not follow any degree path. I applied to most UCs, Stanford and some state colleges, only one of them accepted me, SFSU, but was not offering any scholarship, I did not have the money to go so I waited for a better opportunity. Affirmative Action failed me. It felt as if no one wanted me to get an education. "
  },
  {
    "id": 2,
    "date": "2014-2015",
    "title1": "Worked and Attended",
    "title2": "Community College ",
    "subtitle": "Making my own way, GPA 3.5",
    "description": "Attended a community college with the intent to transfer to Purdue University and worked as a barista at Starbucks. I completed only the necessary requirements for late admission to Purdue University. All I had left was Spanish 2, I took it in the Spring 2015. I was not going to let getting rejected from the colleges I wanted stop me from getting an education."
  },
  {
    "id": 3,
    "date": "August 2015",
    "title1": "Accepted into",
    "title2": "Purdue University!",
    "subtitle": "Taking a risk, GPA: 3.5",
    "description": "Accepted into Purdue University with a partial scholarship. The entire path set before me consisted of four obstacles:  getting accepted into the university, getting accepted into the First Year Engineering College (FYE acceptance rate: 47% over the last 5 years as of 2022), getting accepted into the Elmore Family School of Electrical and Computer Engineering , and then graduate. Because I had one of the obstacles down I was confident and willing to take the risk. "
  },
  {
    "id": 4,
    "date": "May 2016",
    "title1": "Accepted into",
    "title2": "First Year Engineering College",
    "subtitle": "Dreams, Major: Computer Engineering GPA: 2.95   ",
    "description": "Even with all As and Bs in all five of my courses my first semester my GPA dropped significantly. I talked to my counselor and asked why but I was not really given a good explanation. I was discouraged. Nonetheless they accepted me into the First Year Engineering college within Purdue University. Two more obstacles left. While I was at Purdue, I participated in the Engineering Projects in Community Service Course EPICS part of a team that built a project called “A Fresh Start” that was recognize at UC Berkeley. I also helped on the University 3D printing lab website. I also participated in the Minority Engineering Program (MEP), Black Student Union (BSU), and the National Society of Black Engineers (NSBE). I was put on academic probation for my scholarship still active but GPA needed to go up."
  },
  {
    "id": 5,
    "date": "January 2017",
    "title1": "Dropped out of",
    "title2": "Purdue University",
    "subtitle": "The failure, GPA: 2.09",
    "description": "I had part of my tuition covered and the other part I worked to pay, but because I missed my family, surrounded myself with some of the wrong people, made the wrong decisions, and my last semester where I forgot to withdraw, my GPA fell tremendously so I lost my scholarship and my employment at the same time, I could not stay. I was sad and disappointed for a while, as I wanted that degree very much, in my mind I blamed myself for everything, the failure hurt more than anything I had experienced up to this point, I stopped writing code, and even struggled with my mental health for some time because of the experience I had there, but I had to find another way."
  }
]
